hardware_templates = [{
    'Заводские данные': {
        'Гарантия продавца': '12 мес.',
        'Страна-производитель': 'Малайзия'
    },
    'Общие параметры': {
        'Модель': 'Intel Celeron G5905',
        'Сокет': 'LGA 1200', 
        'Год релиза': '2020', 
        'Система охлаждения в комплекте': False, 
        'Термоинтерфейс в комплекте': False
    },
    'Ядро и архитектура': {
        'Общее количество ядер': 2, 
        'Количество производительных ядер': 2, 
        'Количество энергоэффективных ядер': 0, 
        'Максимальное число потоков': 2, 
        'Объем кэша L2': '0.5 МБ', 
        'Объем кэша L3': '4 МБ', 
        'Техпроцесс': '14 нм', 
        'Ядро': 'Intel Comet Lake-S'
    },
    'Частота и возможность разгона': {
        'Базовая частота процессора': '2.5 ГГц', 
        'Максимальная частота в турбо-режиме': '0 ГГц', 
        'Базовая частота энергоэффективных ядер': '0 ГГц', 
        'Частота в турбо-режиме энергоэффективных ядер': '0 ГГц', 
        'Свободный множитель': False,
    },
    'Параметры оперативной памяти': {
        'Тип памяти': 'DDR4', 
        'Максимально поддерживаемый объем памяти': '128 ГБ', 
        'Количество каналов': 2, 
        'Частота оперативной памяти': 'DDR4-2666', 
        'Поддержка режима ECC': False
    },
    'Тепловые характеристики': {
        'Тепловыделение (TDP)': '58 Вт', 
        'Базовое тепловыделение': '58 Вт', 
        'Максимальная температура процессора': '100° C'
    },
    'Графическое ядро': {
        'Интегрированное графическое ядро': True, 
        'Модель графического процессора': 'Intel UHD Graphics 610', 
        'Максимальная частота графического ядра': '1050 Мгц', 
        'Исполнительные блоки': 12, 'Потоковые процессоры (Shading Units)': 96
    },
    'Шина и контроллеры': {
        'Встроенный контроллер PCI Express': 'PCIe 3.0', 
        'Число линий PCI Express': '16 шт'
    },
},]
